Validation/planarLayer/dielectric-dielectric_MultiRegion/Allrun
#!/bin/bash

./makeClean
./makeRegions
interFoamEHDMR

sample -region Fluid
sample -region Solid
