Validation/planarLayer/dielectric-dielectric_MultiRegion/constant/Fluid/electricalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      electricalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phase1
{
    sgm             sgm [-1 -3 3 0 0 2 0] 1.0e-80; 
    eps             eps [-1 -3 4 0 0 2 0] 4e-11;
}
phase2
{
    sgm             sgm [-1 -3 3 0 0 2 0] 1.0e-80;
    eps             eps [-1 -3 4 0 0 2 0] 2e-11;
}

// ************************************************************************* //
