Validation/planarLayer/dielectric-dielectric_MultiRegion/system/Fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rho*phi,U)   Gauss limitedLinearV 1;
    div(phi,alpha)   Gauss vanLeer;
    div(phi,rhoE)    Gauss vanLeer;
    div(MST)         Gauss linear;
    div(phirb,alpha) Gauss interfaceCompression;
    div(((-interpolate(sgm)*magSf)*snGrad(Ue)),rhoE) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    rhoE;
    p_rgh;
    pcorr;
    alpha1;
}


// ************************************************************************* //
