Validation/planarLayer/dielectric-dielectric_MultiRegion/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libCoxVoinovAngle.so" "libcompressibleTurbulenceModel.so" "libcompressibleRASModels.so") ;

application     interFoamEHDMR;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          0.0005;

writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.1;
maxAlphaCo      0.08;

adjustTimeStep  no;


// ************************************************************************* //
